---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralAttachmentTopRatio
source: html/a7d8c036-e95e-61a8-f0aa-f8a0b4f9fdfb.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralAttachmentTopRatio Property

"Top Attachment Ratio"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralAttachmentTopRatio { get; }
```